000100 01 DDDTRL01-FIELD-CONSTANTS.                                     00000100
000200     05 DDDTRL01-NUM-FLDS              PIC S9(4) COMP VALUE 149.  00000200
000300     05 DDDTRL01-KEY-FLDS              PIC S9(4) COMP VALUE 001.  00000300
000400     05 DDDTRL01-SPECIAL-FUNC          PIC X(4) VALUE SPACES.     00000400
000500         88 DDDTRL01-NO-SPECIAL-FUNC   VALUE SPACES.              00000500
000600                                                                  00000600
000700 01 DDDTRL01-INDEX-INFO.                                          00000700
000800     05 DDDTRL01-TABLE-HANDLE          PIC S9(9) COMP VALUE 00120.00000800
000900     05 DDDTRL01-INDEX-HANDLE          PIC S9(4) COMP VALUE 01.   00000900
001000         88 RFCXRL01                   VALUE 01.                  00001000
001100         88 RFCXRL02                   VALUE 02.                  00001100
001200         88 RFCXRL03                   VALUE 03.                  00001200
001300         88 RFCXRL04                   VALUE 04.                  00001300
001400         88 RFCXRL05                   VALUE 05.                  00001400
001500         88 RFCXRL06                   VALUE 06.                  00001500
001600         88 RFCXRL07                   VALUE 07.                  00001600
001700         88 RFCXRL08                   VALUE 08.                  00001700
001800         88 RFCXRL09                   VALUE 09.                  00001800
001900         88 RFCXRL10                   VALUE 10.                  00001900
002000         88 RFCXRL11                   VALUE 11.                  00002000
002100         88 RFCXRL12                   VALUE 12.                  00002100
002200         88 RFCXRL13                   VALUE 13.                  00002200
002300         88 RFCXRL14                   VALUE 14.                  00002300
002400         88 RFCXRL15                   VALUE 15.                  00002400
002500         88 RFCXRL16                   VALUE 16.                  00002500
002600         88 RFCXRL17                   VALUE 17.                  00002600
002700         88 RFCXRL18-NO-IDX            VALUE 999.                 00002700
002800     05 DDDTRL01-MAX-INDICIES          PIC S9(4) COMP VALUE 017.  00002800
002900     05 DDDTRL01-MAX-INDEX-FLDS        PIC S9(4) COMP VALUE 003.  00002900
003000     05 DDDTRL01-INDEX-DATA.                                      00003000
003100         10 RFCXRL01-IDX-FLDS          PIC X(009)                 00003100
003200              VALUE '001000000'.                                  00003200
003300         10 RFCXRL02-IDX-FLDS          PIC X(009)                 00003300
003400              VALUE '002001000'.                                  00003400
003500         10 RFCXRL03-IDX-FLDS          PIC X(009)                 00003500
003600              VALUE '003001000'.                                  00003600
003700         10 RFCXRL04-IDX-FLDS          PIC X(009)                 00003700
003800              VALUE '003002001'.                                  00003800
003900         10 RFCXRL05-IDX-FLDS          PIC X(009)                 00003900
004000              VALUE '004001000'.                                  00004000
004100         10 RFCXRL06-IDX-FLDS          PIC X(009)                 00004100
004200              VALUE '006001000'.                                  00004200
004300         10 RFCXRL07-IDX-FLDS          PIC X(009)                 00004300
004400              VALUE '006002001'.                                  00004400
004500         10 RFCXRL08-IDX-FLDS          PIC X(009)                 00004500
004600              VALUE '010001000'.                                  00004600
004700         10 RFCXRL09-IDX-FLDS          PIC X(009)                 00004700
004800              VALUE '010002001'.                                  00004800
004900         10 RFCXRL10-IDX-FLDS          PIC X(009)                 00004900
005000              VALUE '014001000'.                                  00005000
005100         10 RFCXRL11-IDX-FLDS          PIC X(009)                 00005100
005200              VALUE '014002001'.                                  00005200
005300         10 RFCXRL12-IDX-FLDS          PIC X(009)                 00005300
005400              VALUE '046047001'.                                  00005400
005500         10 RFCXRL13-IDX-FLDS          PIC X(009)                 00005500
005600              VALUE '064001000'.                                  00005600
005700         10 RFCXRL14-IDX-FLDS          PIC X(009)                 00005700
005800              VALUE '064002001'.                                  00005800
005900         10 RFCXRL15-IDX-FLDS          PIC X(009)                 00005900
006000              VALUE '065001000'.                                  00006000
006100         10 RFCXRL16-IDX-FLDS          PIC X(009)                 00006100
006200              VALUE '065002001'.                                  00006200
006300         10 RFCXRL17-IDX-FLDS          PIC X(009)                 00006300
006400              VALUE '066001000'.                                  00006400
006500     05 REDEFINES DDDTRL01-INDEX-DATA.                            00006500
006600         10 INDEX-NUMBER OCCURS 017 TIMES.                        00006600
006700             15 INDEX-FIELDS OCCURS 003 TIMES.                    00006700
006800                 20 INDEX-FIELD        PIC 9(3).                  00006800
006900                                                                  00006900
007000 01 DDDTRL01-FIELD-HANDLES.                                       00007000
007100     05 FC-STORE-NO-H                  PIC S9(4) COMP VALUE 001.  00007100
007200     05 FC-RL-STORE-NM-H               PIC S9(4) COMP VALUE 002.  00007200
007300     05 FC-RL-STORE-CD-H               PIC S9(4) COMP VALUE 003.  00007300
007400     05 FC-RL-STORE-DIR-NM-H           PIC S9(4) COMP VALUE 004.  00007400
007500     05 FC-RL-STORE-LOC-NM-H           PIC S9(4) COMP VALUE 005.  00007500
007600     05 FC-RL-OPENING-DT-H             PIC S9(4) COMP VALUE 006.  00007600
007700     05 FC-RL-CLOSING-DT-H             PIC S9(4) COMP VALUE 007.  00007700
007800     05 FC-RL-REMODEL-DT-H             PIC S9(4) COMP VALUE 008.  00007800
007900     05 FC-RL-DELETED-DT-H             PIC S9(4) COMP VALUE 009.  00007900
008000     05 FC-RL-DISTRICT-NO-H            PIC S9(4) COMP VALUE 010.  00008000
008100     05 FC-RL-MARKET-AR-NO-H           PIC S9(4) COMP VALUE 011.  00008100
008200     05 FC-RL-PAYROL-AR-NO-H           PIC S9(4) COMP VALUE 012.  00008200
008300     05 FC-RL-PAY-GROUP-NO-H           PIC S9(4) COMP VALUE 013.  00008300
008400     05 FC-RL-COMPANY-NO-H             PIC S9(4) COMP VALUE 014.  00008400
008500     05 FC-RL-GEO-ZONE-CD-H            PIC S9(4) COMP VALUE 015.  00008500
008600     05 FC-RL-GEO-ZONE-NO-H            PIC S9(4) COMP VALUE 016.  00008600
008700     05 FC-RL-SCAN-MAIN-CD-H           PIC S9(4) COMP VALUE 017.  00008700
008800     05 FC-RL-FRONT-END-CD-H           PIC S9(4) COMP VALUE 018.  00008800
008900     05 FC-RL-PRICE-BUL-CD-H           PIC S9(4) COMP VALUE 019.  00008900
009000     05 FC-RL-UPC-ON-PB-CD-H           PIC S9(4) COMP VALUE 020.  00009000
009100     05 FC-RL-COMPETITR-CD-H           PIC S9(4) COMP VALUE 021.  00009100
009200     05 FC-RL-ASSOC-STR-NO-H           PIC S9(4) COMP VALUE 022.  00009200
009300     05 FC-RL-RPRT-SEQ-NO-H            PIC S9(4) COMP VALUE 023.  00009300
009400     05 FC-RL-SORT-SOS-NO-H            PIC S9(4) COMP VALUE 024.  00009400
009500     05 FC-RL-VID-PRZN-NO-H            PIC S9(4) COMP VALUE 025.  00009500
009600     05 FC-RL-CITY-ID-CD-H             PIC S9(4) COMP VALUE 026.  00009600
009700     05 FC-RL-ADZONE-ABB-H             PIC S9(4) COMP VALUE 027.  00009700
009800     05 FC-RL-ADZONE-DES-H             PIC S9(4) COMP VALUE 028.  00009800
009900     05 FC-RL-UNLOAD-SW-H              PIC S9(4) COMP VALUE 029.  00009900
010000     05 FN-ROLLUP-REPT-CD-H            PIC S9(4) COMP VALUE 030.  00010000
010100     05 FN-ROLLUP-REPT-EL-1-H          PIC S9(4) COMP VALUE 031.  00010100
010200     05 FN-ROLLUP-REPT-EL-2-H          PIC S9(4) COMP VALUE 032.  00010200
010300     05 FN-ROLLUP-REPT-EL-3-H          PIC S9(4) COMP VALUE 033.  00010300
010400     05 FN-ROLLUP-REPT-EL-4-H          PIC S9(4) COMP VALUE 034.  00010400
010500     05 FN-ROLLUP-REPT-EL-5-H          PIC S9(4) COMP VALUE 035.  00010500
010600     05 FN-ROLLUP-REPT-EL-6-H          PIC S9(4) COMP VALUE 036.  00010600
010700     05 FN-ROLLUP-REPT-EL-7-H          PIC S9(4) COMP VALUE 037.  00010700
010800     05 FN-ROLLUP-REPT-EL-8-H          PIC S9(4) COMP VALUE 038.  00010800
010900     05 FN-ROLLUP-REPT-EL-9-H          PIC S9(4) COMP VALUE 039.  00010900
011000     05 FN-ROLLUP-REPT-EL-10-H         PIC S9(4) COMP VALUE 040.  00011000
011100     05 FC-RL-STATUS-CD-H              PIC S9(4) COMP VALUE 041.  00011100
011200     05 FC-RL-NEW-STORE-CD-H           PIC S9(4) COMP VALUE 042.  00011200
011300     05 FC-RL-TYPE-CD-H                PIC S9(4) COMP VALUE 043.  00011300
011400     05 FC-RL-GROUP-CD-H               PIC S9(4) COMP VALUE 044.  00011400
011500     05 FC-RL-SELECTCIR-CD-H           PIC S9(4) COMP VALUE 045.  00011500
011600     05 FC-RL-AREA-CODE-NO-H           PIC S9(4) COMP VALUE 046.  00011600
011700     05 FC-RL-TELEPHONE-NO-H           PIC S9(4) COMP VALUE 047.  00011700
011800     05 FC-RL-STORE-ABB-H              PIC S9(4) COMP VALUE 048.  00011800
011900     05 FC-RL-BCKRM-FT-QTY-H           PIC S9(4) COMP VALUE 049.  00011900
012000     05 FC-RL-LFT-FOOD-QTY-H           PIC S9(4) COMP VALUE 050.  00012000
012100     05 FC-RL-LFT-NONF-QTY-H           PIC S9(4) COMP VALUE 051.  00012100
012200     05 FC-RL-SETOFF-CD-H              PIC S9(4) COMP VALUE 052.  00012200
012300     05 FC-RL-CL12-ZONE-NO-H           PIC S9(4) COMP VALUE 053.  00012300
012400     05 FC-RL-CL12-ADZN-NO-H           PIC S9(4) COMP VALUE 054.  00012400
012500     05 FC-RL-CL13-ZONE-NO-H           PIC S9(4) COMP VALUE 055.  00012500
012600     05 FC-RL-CL13-ADZN-NO-H           PIC S9(4) COMP VALUE 056.  00012600
012700     05 FC-RL-CL14-ZONE-NO-H           PIC S9(4) COMP VALUE 057.  00012700
012800     05 FC-RL-CL14-ADZN-NO-H           PIC S9(4) COMP VALUE 058.  00012800
012900     05 FC-RL-CL36-ADZN-NO-H           PIC S9(4) COMP VALUE 059.  00012900
013000     05 FC-RL-CL37-ADZN-NO-H           PIC S9(4) COMP VALUE 060.  00013000
013100     05 FC-RL-STORE-DEA-NO-H           PIC S9(4) COMP VALUE 061.  00013100
013200     05 FC-RL-RETL-ZONE-NO-H           PIC S9(4) COMP VALUE 062.  00013200
013300     05 FC-RL-STOR2-LOC-NM-H           PIC S9(4) COMP VALUE 063.  00013300
013400     05 FC-CITY-ADR-H                  PIC S9(4) COMP VALUE 064.  00013400
013500     05 FC-STATE-ADR-H                 PIC S9(4) COMP VALUE 065.  00013500
013600     05 FC-ZIP-CODE5-ADR-H             PIC S9(4) COMP VALUE 066.  00013600
013700     05 FC-ZIP-CODE4-ADR-H             PIC S9(4) COMP VALUE 067.  00013700
013800     05 FC-RL-SOS-TYPE-CD-H            PIC S9(4) COMP VALUE 068.  00013800
013900     05 FC-RL-NOPROCESS-CD-H           PIC S9(4) COMP VALUE 069.  00013900
014000     05 FC-RL-SOSHDRTYP-CD-H           PIC S9(4) COMP VALUE 070.  00014000
014100     05 FC-RL-CAT-CLASS-TB-H           PIC S9(4) COMP VALUE 071.  00014100
014200     05 FC-RL-CAT-CLASS-EL-1-H         PIC S9(4) COMP VALUE 072.  00014200
014300     05 FC-RL-CAT-CLASS-EL-2-H         PIC S9(4) COMP VALUE 073.  00014300
014400     05 FC-RL-CAT-CLASS-EL-3-H         PIC S9(4) COMP VALUE 074.  00014400
014500     05 FC-RL-CAT-CLASS-EL-4-H         PIC S9(4) COMP VALUE 075.  00014500
014600     05 FC-RL-CAT-CLASS-EL-5-H         PIC S9(4) COMP VALUE 076.  00014600
014700     05 FC-RL-CAT-CLASS-EL-6-H         PIC S9(4) COMP VALUE 077.  00014700
014800     05 FC-RL-CAT-CLASS-EL-7-H         PIC S9(4) COMP VALUE 078.  00014800
014900     05 FC-RL-CAT-CLASS-EL-8-H         PIC S9(4) COMP VALUE 079.  00014900
015000     05 FC-RL-CAT-CLASS-EL-9-H         PIC S9(4) COMP VALUE 080.  00015000
015100     05 FC-RL-CAT-CLASS-EL-10-H        PIC S9(4) COMP VALUE 081.  00015100
015200     05 FC-RL-CAT-CLASS-EL-11-H        PIC S9(4) COMP VALUE 082.  00015200
015300     05 FC-RL-CAT-CLASS-EL-12-H        PIC S9(4) COMP VALUE 083.  00015300
015400     05 FC-RL-CAT-CLASS-EL-13-H        PIC S9(4) COMP VALUE 084.  00015400
015500     05 FC-RL-CAT-CLASS-EL-14-H        PIC S9(4) COMP VALUE 085.  00015500
015600     05 FC-RL-CAT-CLASS-EL-15-H        PIC S9(4) COMP VALUE 086.  00015600
015700     05 FC-RL-CAT-CLASS-EL-16-H        PIC S9(4) COMP VALUE 087.  00015700
015800     05 FC-RL-CAT-CLASS-EL-17-H        PIC S9(4) COMP VALUE 088.  00015800
015900     05 FC-RL-CAT-CLASS-EL-18-H        PIC S9(4) COMP VALUE 089.  00015900
016000     05 FC-RL-CAT-CLASS-EL-19-H        PIC S9(4) COMP VALUE 090.  00016000
016100     05 FC-RL-CAT-CLASS-EL-20-H        PIC S9(4) COMP VALUE 091.  00016100
016200     05 FC-RL-CAT-CLASS-EL-21-H        PIC S9(4) COMP VALUE 092.  00016200
016300     05 FC-RL-CAT-CLASS-EL-22-H        PIC S9(4) COMP VALUE 093.  00016300
016400     05 FC-RL-CAT-CLASS-EL-23-H        PIC S9(4) COMP VALUE 094.  00016400
016500     05 FC-RL-CAT-CLASS-EL-24-H        PIC S9(4) COMP VALUE 095.  00016500
016600     05 FC-RL-CAT-CLASS-EL-25-H        PIC S9(4) COMP VALUE 096.  00016600
016700     05 FC-RL-CAT-CLASS-EL-26-H        PIC S9(4) COMP VALUE 097.  00016700
016800     05 FC-RL-CAT-CLASS-EL-27-H        PIC S9(4) COMP VALUE 098.  00016800
016900     05 FC-RL-CAT-CLASS-EL-28-H        PIC S9(4) COMP VALUE 099.  00016900
017000     05 FC-RL-CAT-CLASS-EL-29-H        PIC S9(4) COMP VALUE 100.  00017000
017100     05 FC-RL-CAT-CLASS-EL-30-H        PIC S9(4) COMP VALUE 101.  00017100
017200     05 FC-RL-CAT-CLASS-EL-31-H        PIC S9(4) COMP VALUE 102.  00017200
017300     05 FC-RL-CAT-CLASS-EL-32-H        PIC S9(4) COMP VALUE 103.  00017300
017400     05 FC-RL-CAT-CLASS-EL-33-H        PIC S9(4) COMP VALUE 104.  00017400
017500     05 FC-RL-CAT-CLASS-EL-34-H        PIC S9(4) COMP VALUE 105.  00017500
017600     05 FC-RL-CAT-CLASS-EL-35-H        PIC S9(4) COMP VALUE 106.  00017600
017700     05 FC-RL-CAT-CLASS-EL-36-H        PIC S9(4) COMP VALUE 107.  00017700
017800     05 FC-RL-CAT-CLASS-EL-37-H        PIC S9(4) COMP VALUE 108.  00017800
017900     05 FC-RL-CAT-CLASS-EL-38-H        PIC S9(4) COMP VALUE 109.  00017900
018000     05 FC-RL-CAT-CLASS-EL-39-H        PIC S9(4) COMP VALUE 110.  00018000
018100     05 FC-RL-CAT-CLASS-EL-40-H        PIC S9(4) COMP VALUE 111.  00018100
018200     05 FC-RL-CAT-CLASS-EL-41-H        PIC S9(4) COMP VALUE 112.  00018200
018300     05 FC-RL-CAT-CLASS-EL-42-H        PIC S9(4) COMP VALUE 113.  00018300
018400     05 FC-RL-CAT-CLASS-EL-43-H        PIC S9(4) COMP VALUE 114.  00018400
018500     05 FC-RL-CAT-CLASS-EL-44-H        PIC S9(4) COMP VALUE 115.  00018500
018600     05 FC-RL-CAT-CLASS-EL-45-H        PIC S9(4) COMP VALUE 116.  00018600
018700     05 FC-RL-CAT-CLASS-EL-46-H        PIC S9(4) COMP VALUE 117.  00018700
018800     05 FC-RL-CAT-CLASS-EL-47-H        PIC S9(4) COMP VALUE 118.  00018800
018900     05 FC-RL-CAT-CLASS-EL-48-H        PIC S9(4) COMP VALUE 119.  00018900
019000     05 FC-RL-CAT-CLASS-EL-49-H        PIC S9(4) COMP VALUE 120.  00019000
019100     05 FC-RL-CAT-CLASS-EL-50-H        PIC S9(4) COMP VALUE 121.  00019100
019200     05 FC-RL-CAT-CLASS-EL-51-H        PIC S9(4) COMP VALUE 122.  00019200
019300     05 FC-RL-CAT-CLASS-EL-52-H        PIC S9(4) COMP VALUE 123.  00019300
019400     05 FC-RL-CAT-CLASS-EL-53-H        PIC S9(4) COMP VALUE 124.  00019400
019500     05 FC-RL-CAT-CLASS-EL-54-H        PIC S9(4) COMP VALUE 125.  00019500
019600     05 FC-RL-CAT-CLASS-EL-55-H        PIC S9(4) COMP VALUE 126.  00019600
019700     05 FC-RL-CAT-CLASS-EL-56-H        PIC S9(4) COMP VALUE 127.  00019700
019800     05 FC-RL-CAT-CLASS-EL-57-H        PIC S9(4) COMP VALUE 128.  00019800
019900     05 FC-RL-CAT-CLASS-EL-58-H        PIC S9(4) COMP VALUE 129.  00019900
020000     05 FC-RL-CAT-CLASS-EL-59-H        PIC S9(4) COMP VALUE 130.  00020000
020100     05 FC-RL-CAT-CLASS-EL-60-H        PIC S9(4) COMP VALUE 131.  00020100
020200     05 FC-RL-CAT-CLASS-EL-61-H        PIC S9(4) COMP VALUE 132.  00020200
020300     05 FC-RL-CAT-CLASS-EL-62-H        PIC S9(4) COMP VALUE 133.  00020300
020400     05 FC-RL-CAT-CLASS-EL-63-H        PIC S9(4) COMP VALUE 134.  00020400
020500     05 FC-RL-CAT-CLASS-EL-64-H        PIC S9(4) COMP VALUE 135.  00020500
020600     05 FC-RL-CAT-CLASS-EL-65-H        PIC S9(4) COMP VALUE 136.  00020600
020700     05 FC-RL-CAT-CLASS-EL-66-H        PIC S9(4) COMP VALUE 137.  00020700
020800     05 FC-RL-CAT-CLASS-EL-67-H        PIC S9(4) COMP VALUE 138.  00020800
020900     05 FC-RL-CAT-CLASS-EL-68-H        PIC S9(4) COMP VALUE 139.  00020900
021000     05 FC-RL-CAT-CLASS-EL-69-H        PIC S9(4) COMP VALUE 140.  00021000
021100     05 FC-RL-CAT-CLASS-EL-70-H        PIC S9(4) COMP VALUE 141.  00021100
021200     05 FC-RL-CAT-CLASS-EL-71-H        PIC S9(4) COMP VALUE 142.  00021200
021300     05 FC-RL-CAT-CLASS-EL-72-H        PIC S9(4) COMP VALUE 143.  00021300
021400     05 FC-RL-CAT-CLASS-EL-73-H        PIC S9(4) COMP VALUE 144.  00021400
021500     05 FC-RL-CAT-CLASS-EL-74-H        PIC S9(4) COMP VALUE 145.  00021500
021600     05 FC-RL-LATITUDE-K-H             PIC S9(4) COMP VALUE 146.  00021600
021700     05 FC-RL-LONGITUDE-K-H            PIC S9(4) COMP VALUE 147.  00021700
021800     05 FN-DIVISION-CD-H               PIC S9(4) COMP VALUE 148.  00021800
021900     05 FN-LINE-OF-BUS-CD-H            PIC S9(4) COMP VALUE 149.  00021900
