000100*---------------------------------------------------------------- 00000100
000200* This copybook is unique to MMMS0161.                            00000200
000300* --------------------------------------------------------------- 00000300
000400 01 MMMC0161.                                                     00000400
000500     05 MMMC0161-CZ-CURRENT-SW        PIC X(1)   VALUE SPACES.    00000500
000600         88 MMMC0161-CZ-IS-CURRENT               VALUE 'Y'.       00000600
000700         88 MMMC0161-CZ-IS-NOT-CURRENT           VALUE 'C'.       00000700
000800     05 FILLER                        PIC X(100) VALUE SPACES.    00000800
