000100*---------------------------------------------------------------- 00010001
000200* This copybook is unique to MMMS0257.                            00020001
000300* --------------------------------------------------------------- 00030001
000400 01 MMMC0257.                                                     00040001
000500     05 MMMC0257-DP-CURRENT-SW   PIC X(1)   VALUE SPACES.         00050001
000600         88 MMMC0257-DP-IS-NOT-CURRENT      VALUE ' '.            00060001
000700         88 MMMC0257-DP-IS-CURRENT          VALUE 'X'.            00070001
000800     05 FILLER                         PIC X(100) VALUE SPACES.   00080001
