01 P-DDDTZS01.                                                   
    05 AD-ZONE                        PIC S9(007) COMP-3 VALUE 0.
    05 FC-STORE-NO                    PIC S9(005) COMP-3 VALUE 0.
    05 SP-ADZN-STR-EFF-DT             PIC X(10)  VALUE SPACES.   