000100 01 P-DDDTFX01.                                                 
000200     05 LOC-TYP-CD                     PIC X(2)  VALUE SPACES.  
000300     05 LOC-NBR                        PIC S9(9) COMP VALUE 0.  
000400     05 FAX-ID                         PIC S9(9) COMP VALUE 0.  
000500     05 FAX-CMT                        PIC X(30)  VALUE SPACES. 
000600     05 FAX-PHN-CNTRY-CD               PIC S9(9) COMP VALUE 0.  
000700     05 FAX-AREA-CD                    PIC S9(3) COMP-3 VALUE 0.
000800     05 FAX-PHN-NBR                    PIC S9(7) COMP-3 VALUE 0.
000900     05 LOCL-NBR-SW                    PIC X(1)  VALUE SPACES.  
001000     05 FILLER                         PIC X(250) VALUE SPACES. 