       01 P-DDDTCZ01.
           05 LOC-TYP-CD                     PIC X(2)  VALUE SPACES.
           05 LOC-NBR                        PIC S9(9) COMP VALUE 0.
           05 ITM-CLS-CD                     PIC S9(3) COMP-3 VALUE 0.
           05 AD-ZONE                        PIC S9(7) COMP-3 VALUE 0.
           05 AD-ZONE-EXCP                   PIC S9(7) COMP-3 VALUE 0.
           05 FILLER                         PIC X(250) VALUE SPACES.
