*----------------------------------------------------------------
* This copybook is unique to WWWS0040.                           
* ---------------------------------------------------------------
 01 WWWC0040.                                                    
     05 WWWC0040-SCTLCT20-CURRENT-SW   PIC X(1)   VALUE SPACES.  
         88 WWWC0040-SCTLCT20-NOT-CURRENT         VALUE ' '.     
         88 WWWC0040-SCTLCT20-IS-CURRENT          VALUE 'X'.     
     05 FILLER                         PIC X(100) VALUE SPACES.  