000100 IDENTIFICATION DIVISION.                                         00000100
000200 PROGRAM-ID.    WWWS0040.                                         00000200
000300 AUTHOR.        Name.                                             00000300
000400 DATE-WRITTEN.  Circa 1600.                                       00000400
002200 ENVIRONMENT DIVISION.                                            00002200
002300 DATA DIVISION.                                                   00002300
002400 WORKING-STORAGE SECTION.                                         00002400
002500* --------------------------------------------------------------- 00002500
002600* Misc working storage...                                         00002600
002700* --------------------------------------------------------------- 00002700
002800 01 WS-SQLCODE                      PIC ----9.                    00002800
002900                                                                  00002900
003000 01 WS-SUBRS.                                                     00003000
003100     05 NNNS0573-DP-DAO             PIC X(8) VALUE 'NNNS0573'.    00003100
003200                                                                  00003200
003300 01 WS-NNNN0000-EXIT-CODES          PIC S9(4) COMP VALUE 0.       00003300
003400                                                                  00003400
003500* --------------------------------------------------------------- 00003500
003600* Miscellaneous copy books go here...                             00003600
003700* --------------------------------------------------------------- 00003700
003800 COPY YYYN000A.                                                   00003800
003900 COPY YYYN000C.                                                   00003900
004000 COPY YYYN110A.                                                   00004000
004100 COPY YYYN111A.                                                   00004100
004200 COPY YYYC0097.                                                   00004200
004300 COPY MMMK001D.                                                   00004300
004400                                                                  00004400
004500* ----------------------------------------------------------------00004500
004600* "New" database copybooks go here...                             00004600
004700* ----------------------------------------------------------------00004700
004800 COPY PPPTDP01.                                                   00004800
004900                                                                  00004900
005000* ----------------------------------------------------------------00005000
005100* DB2 stuff...                                                    00005100
005200* ----------------------------------------------------------------00005200
005300                                                                  00005300
005400     EXEC SQL                                                     00005400
005500       INCLUDE DDDTDP01                                           00005500
005600     END-EXEC                                                     00005600
005700                                                                  00005700
005800     EXEC SQL                                                     00005800
005900       INCLUDE SQLCA                                              00005900
006000     END-EXEC                                                     00006000
006100                                                                  00006100
006200 LINKAGE SECTION.                                                 00006200
006300 COPY XXXN001A.                                                   00006300
006400 COPY YYYN005A.                                                   00006400
006500 COPY NNNN0000.                                                   00006500
006600 COPY WWWC0040.                                                   00006600
006700 COPY XXXLCT20.                                                   00006700
006800                                                                  00006800
006900 PROCEDURE DIVISION USING                                         00006900
007000     XXXN001A                                                     00007000
007100     YYYN005A                                                     00007100
007200     NNNN0000-PARMS                                               00007200
007300     WWWC0040                                                     00007300
007400     XXXLCT20                                                     00007400
007500     .                                                            00007500
007600                                                                  00007600
007700*================================================================ 00007700
007800* Start of program main line.                                     00007800
007900*================================================================ 00007900
008000 000-MAIN.                                                        00008000
008100     PERFORM 100-INITIALIZE                                       00008100
008200                                                                  00008200
008300     IF SUCCESS                                                   00008300
008400       PERFORM 120-SETUP-KEYS                                     00008400
008500       IF SUCCESS                                                 00008500
008600         EVALUATE TRUE                                            00008600
008700           WHEN EXIT-OPEN-CURSOR                                  00008700
008800              PERFORM 1000-EXIT-OPEN-CURSOR                       00008800
008900           WHEN EXIT-CLOSE-CURSOR                                 00008900
009000              PERFORM 1100-EXIT-CLOSE-CURSOR                      00009000
009100           WHEN EXIT-GET-UNIQUE-ROW                               00009100
009200              PERFORM 1200-EXIT-GET-UNIQUE-ROW                    00009200
009300           WHEN EXIT-GET-NEXT-ROW                                 00009300
009400              PERFORM 1300-EXIT-GET-NEXT-ROW                      00009400
009500           WHEN EXIT-PUT-MODIFY-ROW                               00009500
009600              PERFORM 1400-EXIT-PUT-MODIFY-ROW                    00009600
009700           WHEN EXIT-PUT-INSERT-ROW                               00009700
009800              PERFORM 1500-EXIT-PUT-INSERT-ROW                    00009800
009900           WHEN EXIT-PUT-PURGE-ROW                                00009900
010000              PERFORM 1600-EXIT-PUT-PURGE-ROW                     00010000
010100         END-EVALUATE                                             00010100
010200       END-IF                                                     00010200
010300     END-IF                                                       00010300
010400                                                                  00010400
010500     GOBACK                                                       00010500
010600     .                                                            00010600
010700                                                                  00010700
010800                                                                  00010800
010900*================================================================ 00010900
011000* Initialization...                                               00011000
011100*================================================================ 00011100
011200 100-INITIALIZE.                                                  00011200
011300     PERFORM 110-MISC-INITS                                       00011300
011400     IF SUCCESS                                                   00011400
011500       PERFORM 120-SETUP-KEYS                                     00011500
011600     END-IF                                                       00011600
011700     .                                                            00011700
011800                                                                  00011800
011900                                                                  00011900
012000 110-MISC-INITS.                                                  00012000
012100     INITIALIZE XXXN001A                                          00012100
012200                                                                  00012200
012300     MOVE 'WWWS0040'                TO YYYC0097-ERROR-PGM         00012300
012400                                                                  00012400
012500     EVALUATE TRUE                                                00012500
012600       WHEN YYYN005A-CICS-ENV                                     00012600
012700         SET YYYN110A-CICS-ENV      TO TRUE                       00012700
012800       WHEN YYYN005A-BATCH-ENV                                    00012800
012900         SET YYYN110A-BATCH-ENV     TO TRUE                       00012900
013000       WHEN OTHER                                                 00013000
013100         SET FAILURE                TO TRUE                       00013100
013200         MOVE 'WWWS0040 - Invalid environment variable.'          00013200
013300                                    TO IS-RTRN-MSG-TXT            00013300
013400     END-EVALUATE                                                 00013400
013500     .                                                            00013500
013600                                                                  00013600
013700                                                                  00013700
013800 120-SETUP-KEYS.                                                  00013800
013900     EXIT                                                         00013900
014000     .                                                            00014000
014100                                                                  00014100
014200                                                                  00014200
014300*================================================================ 00014300
014400* First, lets get the data we are missing...                      00014400
014500*================================================================ 00014500
014600 200-CHECK-INPUTS.                                                00014600
014700     EXIT                                                         00014700
014800     .                                                            00014800
014900                                                                  00014900
015000                                                                  00015000
015100* ================================================================00015100
015200* Open cursor logic...                                            00015200
015300* ================================================================00015300
015400 1000-EXIT-OPEN-CURSOR.                                           00015400
015500     SET  FAILURE                   TO TRUE                       00015500
015600     MOVE 'WWWS0040 - Open Cursor is not supported - YET!'        00015600
015700                                    TO IS-RTRN-MSG-TXT            00015700
015800     .                                                            00015800
015900                                                                  00015900
016000                                                                  00016000
016100* ================================================================00016100
016200* Close cursor logic...                                           00016200
016300* ================================================================00016300
016400 1100-EXIT-CLOSE-CURSOR.                                          00016400
016500     SET  FAILURE                   TO TRUE                       00016500
016600     MOVE 'WWWS0040 - Close Cursor is not supported - YET!'       00016600
016700                                    TO IS-RTRN-MSG-TXT            00016700
016800     .                                                            00016800
016900                                                                  00016900
017000                                                                  00017000
017100* ================================================================00017100
017200* Get unique...                                                   00017200
017300* ================================================================00017300
017400 1200-EXIT-GET-UNIQUE-ROW.                                        00017400
017500     PERFORM 1210-PROCESS-DP                                      00017500
017600     .                                                            00017600
017700                                                                  00017700
017800                                                                  00017800
017900 1210-PROCESS-DP.                                                 00017900
018000     PERFORM 2200-GET-DP                                          00018000
018100     IF SUCCESS                                                   00018100
018200       SET YYYN111A-NEW-2-OLD       TO TRUE                       00018200
018300       PERFORM 2000-DP-TRANSLATION                                00018300
018400     END-IF                                                       00018400
018500     .                                                            00018500
018600                                                                  00018600
018700                                                                  00018700
018800* ================================================================00018800
018900* Get next...                                                     00018900
019000* ================================================================00019000
019100 1300-EXIT-GET-NEXT-ROW.                                          00019100
019200     SET  FAILURE                   TO TRUE                       00019200
019300     MOVE 'WWWS0040 - Get-Next is not supported - YET!'           00019300
019400                                    TO IS-RTRN-MSG-TXT            00019400
019500     .                                                            00019500
019600                                                                  00019600
019700                                                                  00019700
019800* ================================================================00019800
019900* Modify...                                                       00019900
020000* ================================================================00020000
020100 1400-EXIT-PUT-MODIFY-ROW.                                        00020100
020200     PERFORM 1410-PROCESS-DP                                      00020200
020300     .                                                            00020300
020400                                                                  00020400
020500                                                                  00020500
020600 1410-PROCESS-DP.                                                 00020600
020700     PERFORM 2200-GET-DP                                          00020700
020800     IF SUCCESS                                                   00020800
020900                                                                  00020900
021000       SET YYYN111A-OLD-2-NEW       TO TRUE                       00021000
021100       PERFORM 2000-DP-TRANSLATION                                00021100
021200                                                                  00021200
021300       IF SUCCESS                                                 00021300
021400         PERFORM 2400-CALL-DP-DAO                                 00021400
021500                                                                  00021500
021600         EVALUATE TRUE                                            00021600
021700           WHEN NOT SUCCESS                                       00021700
021800             CONTINUE                                             00021800
021900           WHEN SQLCODE = 100                                     00021900
022000             SET FAILURE TO TRUE                                  00022000
022100             MOVE 'WWWS0040 - Store Department not found!'        00022100
022200               TO IS-RTRN-MSG-TXT                                 00022200
022300           WHEN SQLCODE = -530                                    00022300
022400             PERFORM 9998-DB2-530-ERROR                           00022400
022500           WHEN SQLCODE NOT = 0                                   00022500
022600             PERFORM 9999-SETUP-DB2-ERROR                         00022600
022700             STRING 'WWWS0040 - Failed on upd XXX_DEPT,SQL  ='    00022700
022800                 WS-SQLCODE                                       00022800
022900                 DELIMITED BY SIZE INTO IS-RTRN-MSG-TXT           00022900
023000         END-EVALUATE                                             00023000
023100                                                                  00023100
023200         IF SUCCESS                                               00023200
023300           SET YYYN111A-NEW-2-OLD   TO TRUE                       00023300
023400           PERFORM 2000-DP-TRANSLATION                            00023400
023500         END-IF                                                   00023500
023600       END-IF                                                     00023600
023700     END-IF                                                       00023700
023800     .                                                            00023800
023900                                                                  00023900
024000                                                                  00024000
024100* ================================================================00024100
024200* Insert...                                                       00024200
024300* ================================================================00024300
024400 1500-EXIT-PUT-INSERT-ROW.                                        00024400
024500     PERFORM 1510-PROCESS-DP                                      00024500
024600     .                                                            00024600
024700                                                                  00024700
024800                                                                  00024800
024900 1510-PROCESS-DP.                                                 00024900
025000     SET YYYN111A-OLD-2-NEW         TO TRUE                       00025000
025100     PERFORM 2000-DP-TRANSLATION                                  00025100
025200                                                                  00025200
025300     IF SUCCESS                                                   00025300
025400       PERFORM 2400-CALL-DP-DAO                                   00025400
025500                                                                  00025500
025600       EVALUATE TRUE                                              00025600
025700         WHEN SQLCODE = -803                                      00025700
025800            PERFORM 2200-GET-DP                                   00025800
025900            IF SUCCESS                                            00025900
026000              SET YYYN111A-OLD-2-NEW TO TRUE                      00026000
026100              PERFORM 2000-DP-TRANSLATION                         00026100
026200              IF SUCCESS                                          00026200
026300                 PERFORM 1515-TRY-UPDATE                          00026300
026400              END-IF                                              00026400
026500            END-IF                                                00026500
026600         WHEN NOT SUCCESS                                         00026600
026700           CONTINUE                                               00026700
026800         WHEN SQLCODE = -530                                      00026800
026900           PERFORM 9998-DB2-530-ERROR                             00026900
027000         WHEN SQLCODE NOT = 0                                     00027000
027100           PERFORM 9999-SETUP-DB2-ERROR                           00027100
027200           STRING 'WWWS0040 - Failed adding XXX_DEPT ,SQL='       00027200
027300               WS-SQLCODE                                         00027300
027400               DELIMITED BY SIZE INTO IS-RTRN-MSG-TXT             00027400
027500       END-EVALUATE                                               00027500
027600                                                                  00027600
027700       IF SUCCESS                                                 00027700
027800         SET YYYN111A-NEW-2-OLD     TO TRUE                       00027800
027900         PERFORM 2000-DP-TRANSLATION                              00027900
028000       END-IF                                                     00028000
028100     END-IF                                                       00028100
028200     .                                                            00028200
028300                                                                  00028300
028400                                                                  00028400
028500 1515-TRY-UPDATE.                                                 00028500
028600                                                                  00028600
028700     SET EXIT-PUT-MODIFY-ROW        TO TRUE                       00028700
028800     PERFORM 2400-CALL-DP-DAO                                     00028800
028900     EVALUATE TRUE                                                00028900
029000       WHEN NOT SUCCESS                                           00029000
029100         CONTINUE                                                 00029100
029200       WHEN SQLCODE = -530                                        00029200
029300         PERFORM 9998-DB2-530-ERROR                               00029300
029400       WHEN SQLCODE NOT = 0                                       00029400
029500         PERFORM 9999-SETUP-DB2-ERROR                             00029500
029600         STRING 'WWWS0040 - Failed on upd XXX_DEPT ,SQL='         00029600
029700             WS-SQLCODE                                           00029700
029800             DELIMITED BY SIZE INTO IS-RTRN-MSG-TXT               00029800
029900     END-EVALUATE                                                 00029900
030000     SET EXIT-PUT-INSERT-ROW        TO TRUE                       00030000
030100     .                                                            00030100
030200                                                                  00030200
030300                                                                  00030300
030400* ================================================================00030400
030500* Delete...                                                       00030500
030600* ================================================================00030600
030700 1600-EXIT-PUT-PURGE-ROW.                                         00030700
030800     PERFORM 1610-PURGE-DP-ROW                                    00030800
030900     .                                                            00030900
031000                                                                  00031000
031100                                                                  00031100
031200 1610-PURGE-DP-ROW.                                               00031200
031300     SET YYYN111A-OLD-2-NEW         TO TRUE                       00031300
031400     PERFORM 2000-DP-TRANSLATION                                  00031400
031500                                                                  00031500
031600     IF SUCCESS                                                   00031600
031700       SET EXIT-PUT-PURGE-ROW       TO TRUE                       00031700
031800       PERFORM 2400-CALL-DP-DAO                                   00031800
031900                                                                  00031900
032000       EVALUATE TRUE                                              00032000
032100         WHEN NOT SUCCESS                                         00032100
032200           CONTINUE                                               00032200
032300         WHEN SQLCODE = 100                                       00032300
032400           INITIALIZE XXXN001A                                    00032400
032500         WHEN SQLCODE = -532                                      00032500
032600           PERFORM 9998-DB2-530-ERROR                             00032600
032700         WHEN SQLCODE NOT = 0                                     00032700
032800           PERFORM 9999-SETUP-DB2-ERROR                           00032800
032900           STRING 'WWWS0040 - Failed deleting XXX_DEPT,SQL='      00032900
033000               WS-SQLCODE                                         00033000
033100               DELIMITED BY SIZE INTO IS-RTRN-MSG-TXT             00033100
033200       END-EVALUATE                                               00033200
033300     END-IF                                                       00033300
033400     .                                                            00033400
033500                                                                  00033500
033600                                                                  00033600
033700* ================================================================00033700
033800* Translations...                                                 00033800
033900* ================================================================00033900
034000 2000-DP-TRANSLATION.                                             00034000
034100     CALL MMMS0258-TRANSLATE-DP USING                             00034100
034200         XXXN001A                                                 00034200
034300         YYYN111A                                                 00034300
034400         P-DDDTDP01                                               00034400
034500         XXXLCT20                                                 00034500
034600     .                                                            00034600
034700                                                                  00034700
034800                                                                  00034800
034900* ================================================================00034900
035000* DAO calls and stuff...                                          00035000
035100* ================================================================00035100
035200 2200-GET-DP.                                                     00035200
035300                                                                  00035300
035400     INITIALIZE P-DDDTDP01                                        00035400
035500     SET YYYN111A-OLD-2-NEW TO TRUE                               00035500
035600     PERFORM 2000-DP-TRANSLATION                                  00035600
035700     IF SUCCESS                                                   00035700
035800        PERFORM 2210-GET-DP-RECORD                                00035800
035900     END-IF                                                       00035900
036000     .                                                            00036000
036100                                                                  00036100
036200                                                                  00036200
036300 2210-GET-DP-RECORD.                                              00036300
036400                                                                  00036400
036500     MOVE NNNN0000-EXIT-CODES       TO WS-NNNN0000-EXIT-CODES     00036500
036600     SET  EXIT-GET-UNIQUE-ROW       TO TRUE                       00036600
036700                                                                  00036700
036800     PERFORM 2400-CALL-DP-DAO                                     00036800
036900                                                                  00036900
037000     EVALUATE TRUE                                                00037000
037100       WHEN SQLCODE = 0                                           00037100
037200         CONTINUE                                                 00037200
037300       WHEN SQLCODE = 100                                         00037300
037400         MOVE SPACES                TO IS-RTRN-MSG-TXT            00037400
037500         SET  FAILURE               TO TRUE                       00037500
037600         STRING 'WWWS0040 - DEPT ' ST-DEPARTMENT-KEY              00037600
037700                ' not found in XXX_DEPT'                          00037700
037800                DELIMITED BY SIZE INTO IS-RTRN-MSG-TXT            00037800
037900       WHEN OTHER                                                 00037900
038000         PERFORM 9999-SETUP-DB2-ERROR                             00038000
038100         STRING 'WWWS0040 - Failed on XXX_DEPT(DP),SQL='          00038100
038200                 WS-SQLCODE                                       00038200
038300                 DELIMITED BY SIZE INTO IS-RTRN-MSG-TXT           00038300
038400     END-EVALUATE                                                 00038400
038500                                                                  00038500
038600     MOVE WS-NNNN0000-EXIT-CODES    TO NNNN0000-EXIT-CODES        00038600
038700     .                                                            00038700
038800                                                                  00038800
038900                                                                  00038900
039000* ================================================================00039000
039100* DAO calls and stuff...                                          00039100
039200* ================================================================00039200
039300 2400-CALL-DP-DAO.                                                00039300
039400     CALL NNNS0573-DP-DAO USING                                   00039400
039500         XXXN001A                                                 00039500
039600         SQLCA                                                    00039600
039700         YYYN005A                                                 00039700
039800         NNNN0000-PARMS                                           00039800
039900         P-DDDTDP01                                               00039900
040000     .                                                            00040000
040100                                                                  00040100
040200                                                                  00040200
040300* ================================================================00040300
040400* Misc functions...                                               00040400
040500* ================================================================00040500
040600 9998-DB2-530-ERROR.                                              00040600
040700     CALL Z-DB2-ERROR-HANDLER USING                               00040700
040800         XXXN001A                                                 00040800
040900         SQLCA                                                    00040900
041000         YYYN005A                                                 00041000
041100         YYYC0097                                                 00041100
041200     .                                                            00041200
041300                                                                  00041300
041400                                                                  00041400
041500 9999-SETUP-DB2-ERROR.                                            00041500
041600     MOVE SQLCODE                   TO WS-SQLCODE                 00041600
041700     SET  FAILURE                   TO TRUE                       00041700
041800     MOVE SPACES                    TO IS-RTRN-MSG-TXT            00041800
041900     .                                                            00041900
042000                                                                  00042000
042100                                                                  00042100
