000100 IDENTIFICATION DIVISION.                                         00000100
000200 PROGRAM-ID.    WWWS0100.                                         00000200
000300 AUTHOR.        NAME.                                             00000300
000400 DATE-WRITTEN.  Circa 1600.                                       00000400
000500*---------------------------------------------------------------- 00000500
000600* Master data transitional control subroutine.                    00000600
001900* --------------------------------------------------------------- 00001900
002400 ENVIRONMENT DIVISION.                                            00002400
002500 DATA DIVISION.                                                   00002500
002600 WORKING-STORAGE SECTION.                                         00002600
002700* --------------------------------------------------------------- 00002700
002800* Misc working storage...                                         00002800
002900* --------------------------------------------------------------- 00002900
004900                                                                  00004900
005000 01 WS-SAVE-DATA.                                                 00005000
005050     05 WS-WWWC0100-TASK                PIC X(4)   VALUE SPACES.  00005050
005080     05 WS-WWWC0100-SUBTASK             PIC X(4)   VALUE SPACES.  00005080
005090     05 WS-WWWC0100-UPD-STAT            PIC X(1)   VALUE SPACES.  00005090
005100     05 WS-WWWC0100-EVENT-FLAG          PIC X(1)   VALUE SPACES.  00005100
005200     05 WS-WWWC0100-SCAN-EVENT-FLAG     PIC X(1)   VALUE SPACES.  00005200
005700                                                                  00005700
006800* --------------------------------------------------------------- 00006800
006900* Miscellaneous copy books go here...                             00006900
007000* --------------------------------------------------------------- 00007000
007800                                                                  00007800
009700 LINKAGE SECTION.                                                 00009700
009800 COPY XXXN001A.                                                   00009800
009900 COPY WWWC0100.                                                   00009900
010400                                                                  00010400
010500 PROCEDURE DIVISION USING                                         00010500
010600     XXXN001A                                                     00010600
010700     WWWC0100                                                     00010700
011200     .                                                            00011200
011300                                                                  00011300
011400*================================================================ 00011400
011500* Start of program main line.                                     00011500
011600*================================================================ 00011600
011700 000-MAIN.                                                        00011700
011800     PERFORM 100-INITIALIZE                                       00011800
011900                                                                  00011900
012300     EVALUATE TRUE                                                00012300
012400       WHEN WWWC0100-SET-TASK                                     00012400
012500         PERFORM 200-SET-TASK                                     00012500
012600       WHEN WWWC0100-GET-TASK                                     00012600
012700         PERFORM 300-GET-TASK                                     00012700
013800     END-EVALUATE                                                 00013800
014100                                                                  00014100
014200     GOBACK                                                       00014200
014300     .                                                            00014300
014400                                                                  00014400
014500                                                                  00014500
014600*================================================================ 00014600
014700* Initialization...                                               00014700
014800*================================================================ 00014800
014900 100-INITIALIZE.                                                  00014900
015800     INITIALIZE XXXN001A                                          00015800
017000     .                                                            00017000
017100                                                                  00017100
017200                                                                  00017200
017900*================================================================ 00017900
018000* Set the task being performed...                                 00018000
018200*================================================================ 00018200
018300 200-SET-TASK.                                                    00018300
018400     MOVE WWWC0100-TASK          TO WS-WWWC0100-TASK              00018400
018600     MOVE WWWC0100-SUBTASK       TO WS-WWWC0100-SUBTASK           00018600
018700     MOVE WWWC0100-UPDATE-STATUS TO WS-WWWC0100-UPD-STAT          00018700
018800     MOVE WWWC0100-EVENT-FLAG    TO WS-WWWC0100-EVENT-FLAG        00018800
018900     MOVE WWWC0100-SCAN-EVENT-FLAG                                00018900
019000       TO WS-WWWC0100-SCAN-EVENT-FLAG                             00019000
020800     .                                                            00020800
020900                                                                  00020900
021000                                                                  00021000
021100* ================================================================00021100
021200* Get the task being performed...                                 00021200
021300* ================================================================00021300
021310 300-GET-TASK.                                                    00021310
021320     MOVE WS-WWWC0100-TASK       TO WWWC0100-TASK                 00021320
021330     MOVE WS-WWWC0100-SUBTASK    TO WWWC0100-SUBTASK              00021330
021331     MOVE WS-WWWC0100-UPD-STAT   TO WWWC0100-UPDATE-STATUS        00021331
021332     MOVE WS-WWWC0100-EVENT-FLAG TO WWWC0100-EVENT-FLAG           00021332
021333     MOVE WS-WWWC0100-SCAN-EVENT-FLAG                             00021333
021334       TO WWWC0100-SCAN-EVENT-FLAG                                00021334
021340     .                                                            00021340
021350                                                                  00021350
021360                                                                  00021360
