000100 IDENTIFICATION DIVISION.                                         00000100
000200 PROGRAM-ID.    YYYS0210.                                         00000200
000300 AUTHOR.        NAME.                                             00000300
000400 DATE-WRITTEN.  May 1600.                                         00000400
000500 DATE-COMPILED.                                                   00000500
001800 ENVIRONMENT DIVISION.                                            00001800
001900 CONFIGURATION SECTION.                                           00001900
002000 DATA DIVISION.                                                   00002000
002100 WORKING-STORAGE SECTION.                                         00002100
002200                                                                  00002200
002300* ========================< MISC STUFF >==========================00002300
002400* Misc working storage variables go here.                         00002400
002500* ================================================================00002500
002600 01 WS-SQLCODE                         PIC ----9.                 00002600
002610                                                                  00002610
002700 COPY YYYN000A.                                                   00002700
002800 COPY YYYC0220.                                                   00002800
002900                                                                  00002900
003000 LINKAGE SECTION.                                                 00003000
003100 COPY XXXN001A.                                                   00003100
003200     EXEC SQL                                                     00003200
003300         INCLUDE SQLCA                                            00003300
003400     END-EXEC.                                                    00003400
003500                                                                  00003500
003600 PROCEDURE DIVISION USING                                         00003600
003700     XXXN001A                                                     00003700
003800     SQLCA                                                        00003800
003900     .                                                            00003900
004000                                                                  00004000
004100* ================================================================00004100
004200* Main program line.                                              00004200
004300* ================================================================00004300
004400 0000-EXIT-DISPATCHER.                                            00004400
004500     PERFORM 100-INITIALIZATION                                   00004500
004600     PERFORM 200-CONNECT-TO-ORACLE                                00004600
005000     GOBACK                                                       00005000
005100     .                                                            00005100
005200                                                                  00005200
005300                                                                  00005300
005400* ================================================================00005400
005500* Initialize data areas needed to call the i/o subroutine         00005500
005600* ================================================================00005600
005700 100-INITIALIZATION.                                              00005700
005800     INITIALIZE XXXN001A                                          00005800
005900     MOVE 0 TO SQLCODE                                            00005900
006200     .                                                            00006200
006300                                                                  00006300
006400                                                                  00006400
006500* ================================================================00006500
006600* Connect to DRDA (for Oracle).                                   00006600
006700* ================================================================00006700
007500 200-CONNECT-TO-ORACLE.                                           00007500
007510     SET YYYC0220-SET-ORACLE-CON TO TRUE                          00007510
007530                                                                  00007530
007540     CALL YYYS0220-DBMS-CON-MGR USING                             00007540
007550         XXXN001A                                                 00007550
007560         YYYC0220                                                 00007560
010400     .                                                            00010400
