******************************************************************
* COPY BOOK FOR DB2 ERROR HANDLER OBJECT (YYYS0097)               
******************************************************************
 01 YYYC0097.                                                     
     05 YYYC0097-ERROR-PGM         PIC X(8)   VALUE SPACES.       
     05 YYYC0097-ERROR-LABEL       PIC X(10)  VALUE SPACES.       
     05 YYYC0097-ERROR-SQL-TXT-LNG PIC X(240) VALUE SPACES.       