000100*----------------------------------------------------------------
000200* This copybook is unique to YYYS0040.                           
000300* ---------------------------------------------------------------
000400 01 YYYC0040.                                                    
000500     05 YYYC0040-XXXLCT20-CURRENT-SW   PIC X(1)   VALUE SPACES.  
000600         88 YYYC0040-XXXLCT20-NOT-CURRENT         VALUE ' '.     
000700         88 YYYC0040-XXXLCT20-IS-CURRENT          VALUE 'X'.     
000800     05 FILLER                         PIC X(100) VALUE SPACES.  