000100 01 YYYC0107.                                                     00000100
000200    05 YYYC0107-SYS-ENV             PIC X(2)  VALUE SPACES.       00000200
000300        88 YYYC0107-CICS-ENV                  VALUE SPACES.       00000300
000400        88 YYYC0107-BATCH-ENV                 VALUE 'BT'.         00000400
000500    05 YYYC0107-USER                PIC X(8)  VALUE SPACES.       00000500
000600    05 YYYC0107-USER-NAME           PIC X(30) VALUE SPACES.       00000600
000700    05 FILLER                       PIC X(99) VALUE SPACES.       00000700
