*----------------------------------------------------------------
* This copybook is unique to YYYS0003.                           
* ---------------------------------------------------------------
 01 YYYC0003.                                                    
     05 YYYC0003-LR-CURRENT-SW        PIC X(1)   VALUE SPACES.   
         88 YYYC0003-XXXTRL01-NOT-CURRENT        VALUE ' '.      
         88 YYYC0003-XXXTRL01-IS-CURRENT         VALUE 'X'.      
     05 FILLER                        PIC X(100) VALUE SPACES.   