000100 IDENTIFICATION DIVISION.                                         00000100
000200 PROGRAM-ID.    YYYS0211.                                         00000200
000300 AUTHOR.        NAME                                              00000300
000400 DATE-WRITTEN.  May 1600.                                         00000400
000500 DATE-COMPILED.                                                   00000500
001800 ENVIRONMENT DIVISION.                                            00001800
001900 CONFIGURATION SECTION.                                           00001900
002000 DATA DIVISION.                                                   00002000
002100 WORKING-STORAGE SECTION.                                         00002100
002200                                                                  00002200
002300* ========================< MISC STUFF >==========================00002300
002400* Misc working storage variables go here.                         00002400
002500* ================================================================00002500
002600 01 WS-XXXN001A             PIC X(265) VALUE SPACES.              00002600
003100 COPY YYYN000A.                                                   00003100
003110 COPY YYYC0220.                                                   00003110
003200                                                                  00003200
003300 LINKAGE SECTION.                                                 00003300
003400 COPY XXXN001A.                                                   00003400
003500     EXEC SQL                                                     00003500
003600       INCLUDE SQLCA                                              00003600
003700     END-EXEC.                                                    00003700
003800                                                                  00003800
003900 PROCEDURE DIVISION USING                                         00003900
004000     XXXN001A                                                     00004000
004100     SQLCA                                                        00004100
004200     .                                                            00004200
004300                                                                  00004300
004400* ================================================================00004400
004500* Main program line.                                              00004500
004600* ================================================================00004600
004700 0000-EXIT-DISPATCHER.                                            00004700
004800     PERFORM 100-INITIALIZATION                                   00004800
004900     PERFORM 200-CONNECT-TO-DB2                                   00004900
005000     PERFORM 300-CNV-ORACLE-SQLCODE                               00005000
005100     PERFORM 400-REVERT-SAVED-XXXN001A                            00005100
005300     GOBACK                                                       00005300
005400     .                                                            00005400
005500                                                                  00005500
005600                                                                  00005600
005700* ================================================================00005700
005800* Initialize data areas needed to call the i/o subroutine         00005800
005900* ================================================================00005900
006000 100-INITIALIZATION.                                              00006000
006100     MOVE XXXN001A TO WS-XXXN001A                                 00006100
006200     INITIALIZE XXXN001A                                          00006200
006400     .                                                            00006400
006500                                                                  00006500
006600                                                                  00006600
006700* ================================================================00006700
006800* Connect to DB2...                                               00006800
006900* ================================================================00006900
007300 200-CONNECT-TO-DB2.                                              00007300
007400     SET YYYC0220-SET-DB2-CON TO TRUE                             00007400
007500     CALL YYYS0220-DBMS-CON-MGR USING                             00007500
007600         XXXN001A                                                 00007600
007700         YYYC0220                                                 00007700
008100     .                                                            00008100
008800                                                                  00008800
009100                                                                  00009100
009200* ================================================================00009200
009300* There may be a residual, unconverted Oracle error that we will  00009300
009310* politely convert for the calling program.                       00009310
009400* ================================================================00009400
009500 300-CNV-ORACLE-SQLCODE.                                          00009500
009600     IF  SUCCESS                                                  00009600
009610     AND SQLCODE = -84                                            00009610
009720       CALL Z-ORA-ERR-CONVERSION USING                            00009720
009730           XXXN001A                                               00009730
009740           SQLCA                                                  00009740
009750     END-IF                                                       00009750
010200     .                                                            00010200
010210                                                                  00010210
010220                                                                  00010220
010300* ================================================================00010300
010400* Reset XXXN001A.                                                 00010400
010500* ================================================================00010500
010600 400-REVERT-SAVED-XXXN001A.                                       00010600
010610     MOVE WS-XXXN001A TO XXXN001A                                 00010610
010700     .                                                            00010700
