000100 01 ZZZC0125.                                                     00000100
000200    05 STR-DEPT-NBR              PIC X(5)   VALUE SPACES.         00000200
000300    05 STR-SUB-DEPT-ID           PIC X(5)   VALUE SPACES.         00000300
000400    05 ACTION-TAKEN              PIC X      VALUE SPACE.          00000400
000500       88 STD-ADD                           VALUE 'A'.            00000500
000600       88 STD-UPD                           VALUE 'U'.            00000600
000700       88 STD-DEL                           VALUE 'D'.            00000700
000800    05 FILLER                    PIC X(250) VALUE SPACES.         00000800
