000100 01 ZZZC0094.                                                     00000100
000200     05 LOC-NBR                PIC 9(9)   VALUE 0.                00000200
000300     05 LOC-TYP-CD             PIC X(2)   VALUE SPACES.           00000300
000400     05 ACTION-TAKEN           PIC X(1)   VALUE SPACE.            00000400
000500         88 LOC-ADD                       VALUE 'A'.              00000500
000600         88 LOC-UPD                       VALUE 'U'.              00000600
000700         88 LOC-DEL                       VALUE 'D'.              00000700
000800     05 FILLER                 PIC X(250) VALUE SPACES.           00000800
